-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 07, 2025 at 06:09 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `shop`
--

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

DROP TABLE IF EXISTS `products`;
CREATE TABLE `products` (
  `p_id` int(7) NOT NULL,
  `p_name` varchar(200) NOT NULL,
  `p_detail` text NOT NULL,
  `p_price` float(9,2) NOT NULL,
  `p_ext` varchar(50) NOT NULL,
  `c_id` int(7) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`p_id`, `p_name`, `p_detail`, `p_price`, `p_ext`, `c_id`) VALUES
(1, 'ขนมคอนเน่\r\n', 'โปเต้ ขนมมันฝรั่งรูปเกลียวที่ผลิตจากวัตถุดิบคุณภาพสูง ของว่างรับประทานเล่น รสอร่อย ที่ไม่ว่าจะทานคำไหนก็อร่อยคำนั้น ลองมาเติมความอร่อยของคุณในวันที่น่าเบื่อไปกับโปเต้กันเถอะ\r\n', 20.00, 'jpg', 1),
(2, 'ขนมปาปริก้า', 'เอร็ดอร่อยไปกับ ปาปริก้า มันฝรั่งกรอบ ผลิตภัณฑ์ขนมขบเคี้ยวแสนอร่อยจาก ปาปริก้า แบรนด์มันฝรั่งกรอบคุณภาพเยี่ยมที่ถูกอกถูกใจคนไทยมาอย่างยาวนาน', 20.00, 'jpg', 1),
(3, 'ขนมปาร์ตี้', 'ปาร์ตี้ มันเทศผสมทอดกรอบเคลือบเนยคาราเมล เพราะชีวิตขาดหวานไม่ได้ ลองมาเติมความหวานไปกับขนมขบเคี้ยวแสนอร่อยตราปาร์ตี้กันดีกว่า ขนมมันเทศผสมทอดกรอบเคลือบเนยคาราเมล หวาน มัน ให้คุณฟินไปกับความกรอบอร่อยด้วยรสชาติที่ไม่ซ้ำใคร', 20.00, 'jpg', 1),
(4, 'ขนมโปเต้', 'โปเต้ ขนมมันฝรั่งรูปเกลียวที่ผลิตจากวัตถุดิบคุณภาพสูง ของว่างรับประทานเล่น รสอร่อย ที่ไม่ว่าจะทานคำไหนก็อร่อยคำนั้น ลองมาเติมความอร่อยของคุณในวันที่น่าเบื่อไปกับโปเต้กันเถอะ\r\n', 20.00, 'jpg', 1),
(5, 'น้ำโค้กกระป๋อง 325มล.', 'ดื่มด่ำรสชาติแห่งความสุขไปกับ โคคา-โคล่า โค้ก รสชาติออริจินัล ที่สร้างความเพลิดเพลินไปกับรสชาติของเครื่องดื่มที่สดชื่น ทำให้ช่วงเวลาของคุณพิเศษยิ่งขึ้น ไม่ว่าเวลาไหนๆ', 16.00, 'jpg', 2),
(6, 'น้ำโค้กขวด 1.26 ล.', 'เติมความสุข มอบความซ่าและความสดชื่นได้ทุกๆ วัน ด้วย โค้ก น้ำอัดลม รสออริจินัล สูตรน้ำตาลน้อยกว่า เครื่องดื่มที่จะทำให้สดชื่น สนุก และอร่อย เพลิดเพลินไปกับรสชาติที่จะทำให้ช่วงเวลารับประทานอาหารและเครื่องดื่มพิเศษยิ่งขึ้น', 35.00, 'jpg', 2),
(7, 'แฟนต้า น้ำแดง 320มล.', 'เติมความสุข มอบความซ่าและความสดชื่นได้ทุกๆ วัน ด้วยแฟนต้า น้ำอัดลม น้ำแดง เครื่องดื่มที่จะทำให้สดชื่น สนุก และอร่อย เพลิดเพลินไปกับรสชาติที่จะทำให้ช่วงเวลารับประทานอาหารและเครื่องดื่มพิเศษยิ่งขึ้น', 16.00, 'jpg', 2),
(8, 'ลูกอมจูปาจุ๊ปส์', 'พร้อมสนุกทุกโมเมนต์ไปกับจูปาจุ๊ปส์รสโปรด ไม่ว่าจะไปที่ไหนก็ขอแค่มีจูปาจุ๊ปส์คู่ใจไปด้วย เพราะความฟินที่แท้ทรู', 5.00, 'jpg', 3),
(9, 'ยูปี้ กัมมี่ พิซซ่า', 'เยลลี่รสผลไม้สัญชาติเยอรมัน ที่มีความเป็นเอกลักษณ์ทั้งรสชาติและรูปร่างของเยลลี่ที่ทำออกมาเป็นรูปมินิพิซซ่ รูปทรงน่ารับประทาน ยูปี้พิซซ่า ให้คุณได้สัมผัสความ หวานอมเปรี้ยว ที่จะทำให้คุณติดใจ', 5.00, 'jpg', 3),
(10, 'กาโตะ  น้ำผลไม้ผสมวุ้นมะพร้าว', 'ให้รสชาติหวาน ชื่นใจอร่อยยิ่งขึ้นเมื่อเพิ่มส่วนผสมของวุ้นมะพร้าวลงไปด้วย ดื่มง่าย อิ่มสบายท้อง อิ่มสบายท้อง แก้กระหายน้ำและคลายร้อนได้เป็นอย่างดี', 10.00, 'jpg', 2),
(11, 'โออิชิ กรีนที ชาเขียว รสน้ำผึ้งผสมมะนาว', 'ผ่อนคลายความเหนื่อยล้า เติมพลังให้ร่างกายได้สดชื่นอีกครั้ง ด้วยการจิบชาคุณภาพจาก โออิชิ กรีนที เครื่องดื่มชาเขียวที่พิถีพิถันในการคัดสรรยอดอ่อนใบชาคุณภาพ 3 ใบ ก่อนเข้าสู่กระบวนการผลิตที่ได้มาตรฐานระดับโลกแห่งแรกในประเทศไทย เพื่อให้ได้มาซึ่งรสชาติและคุณประโยชน์ของชาเขียวต่อร่างกายไว้ให้ดีที่สุด', 15.00, 'jpg', 2),
(12, 'อิชิตัน กรีนที รสน้ำผึ้งผสมมะนาว', 'สดชื่นเป็นพิเศษกับชาเขียวออร์แกนิค ผสมน้ำผึ้งมะนาวจึงได้รสชาติเปรี้ยวอมหวาน หอมชุ่มคอ อุดมด้วยวิตามินซี.', 15.00, 'jpg', 2);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`p_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
